PBL5/1_MovieTicketBookingSystem/backend/load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 30
      arrivalRate: 50
      name: "50 RPS"
    - duration: 30
      arrivalRate: 100
      name: "100 RPS"
    - duration: 30
      arrivalRate: 200
      name: "200 RPS"
  processor: "./artillery-processor.js"
  variables:
    seatCount: 150000

scenarios:
  - name: "Booking Load Test"
    weight: 70
    flow:
      - function: "generateSeatsForRequest"
      - post:
          url: "/api/bookings"
          json:
            seat_ids: "{{ seatIds }}"
          capture:
            - json: "$.id"
              as: "bookingId"
              strict: false
          expect:
            - statusCode: [201, 202, 409]
            - contentType: json

  - name: "Atomic Multi-seat Locking Stress Test"
    weight: 15
    flow:
      - function: "generateAtomicitySeatSets"
      - post:
          url: "/api/bookings"
          json:
            seat_ids: "{{ atomicSeatIds }}"
          capture:
            - json: "$.id"
              as: "bookingId"
              strict: false
            - json: "$.unavailable_seats"
              as: "unavailableSeats"
              strict: false
          expect:
            - statusCode: [201, 202, 409]
            - contentType: json